# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [3]:
#Your code here
import sqlite3

conn = sqlite3.connect('data.sqlite')

c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [9]:
#Your code here
query = ('SELECT E.firstName,E.lastName,O.city,O.state '
         'FROM employees E '
         'LEFT JOIN offices O '
         'ON E.officeCode = O.officeCode')
        
c.execute(query)
c.fetchmany(10)

[('Diane', 'Murphy', 'San Francisco', 'CA'),
 ('Mary', 'Patterson', 'San Francisco', 'CA'),
 ('Jeff', 'Firrelli', 'San Francisco', 'CA'),
 ('William', 'Patterson', 'Sydney', ''),
 ('Gerard', 'Bondur', 'Paris', ''),
 ('Anthony', 'Bow', 'San Francisco', 'CA'),
 ('Leslie', 'Jennings', 'San Francisco', 'CA'),
 ('Leslie', 'Thompson', 'San Francisco', 'CA'),
 ('Julie', 'Firrelli', 'Boston', 'MA'),
 ('Steve', 'Patterson', 'Boston', 'MA')]

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [12]:
#Your code here
query = ('SELECT C.contactFirstName,C.contactLastName,O.orderDate,O.status '
         'FROM customers C '
         'LEFT JOIN orders O '
         'ON C.customerNumber = O.customerNumber')
        
c.execute(query)
c.fetchmany(10)

[('Carine ', 'Schmitt', '2003-05-20', 'Shipped'),
 ('Carine ', 'Schmitt', '2004-09-27', 'Shipped'),
 ('Carine ', 'Schmitt', '2004-11-25', 'Shipped'),
 ('Jean', 'King', '2003-05-21', 'Shipped'),
 ('Jean', 'King', '2004-08-06', 'Shipped'),
 ('Jean', 'King', '2004-11-29', 'Shipped'),
 ('Peter', 'Ferguson', '2003-04-29', 'Shipped'),
 ('Peter', 'Ferguson', '2003-05-21', 'Shipped'),
 ('Peter', 'Ferguson', '2004-02-20', 'Shipped'),
 ('Peter', 'Ferguson', '2004-11-24', 'Shipped')]

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [13]:
#Your code here
query = ('SELECT C.contactFirstName,C.contactLastName,P.paymentDate,P.amount '
         'FROM customers C '
         'ON C.customerNumber = P.customerNumber'
         'LEFT JOIN payments P '
         'ON C.customerNumber = P.customerNumber')
        
c.execute(query)
c.fetchmany(10)

[('Carine ', 'Schmitt', '2003-06-05', '14571.44'),
 ('Carine ', 'Schmitt', '2004-10-19', '6066.78'),
 ('Carine ', 'Schmitt', '2004-12-18', '1676.14'),
 ('Jean', 'King', '2003-06-06', '32641.98'),
 ('Jean', 'King', '2004-08-20', '33347.88'),
 ('Jean', 'King', '2004-12-17', '14191.12'),
 ('Peter', 'Ferguson', '2003-05-20', '45864.03'),
 ('Peter', 'Ferguson', '2003-05-31', '7565.08'),
 ('Peter', 'Ferguson', '2004-03-10', '44894.74'),
 ('Peter', 'Ferguson', '2004-12-15', '82261.22')]

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
#Your code here
query = ('SELECT C.contactFirstName,C.contactLastName,P.paymentDate,P.amount '
         'FROM customers C '
         'JOIN orders O '
         'ON C.customerNumber = P.customerNumber'
         'LEFT JOIN orderdetails OD'
         'ON O.orderNumber = OD.orderNumber'
         'LEFT JOIN PR'
         'ON C.customerNumber = P.customerNumber')
        
c.execute(query)
c.fetchmany(10)

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!